namespace OilQuality.Data
{
    public class MethodData
    {
        public Dictionary<string, string> methodsWater = new Dictionary<string, string>()
        {
            { "Водородный показатель", "ПНД Ф 14.1:2:3:4.121" },
            { "Массовая концентрация гидрокарбонатов", "ПНД Ф 14.1:2:3.99" },
            { "Общая жесткость", "ПНД Ф 14.1:2:3.98" },
            { "Массовая концентрация кальция", "ПНД Ф 14.1:2:3.95" },
            { "Массовая концентрация сульфат-ионов", "ПНД Ф 14.1:2.159" },
            { "Массовая концентрация нефтепродуктов", "ПНД Ф 14.1:2:4.128" },
            { "Массовая концентрация хлорид-ионов", "ПНД Ф 14.1:2:3:4.111" },
            { "Содержание хрома (IV)", "ГОСТ Р 52962" },
            { "Содержание общего хрома", "ГОСТ Р 52962" },
            { "Массовая концентрация карбонатов", "ГОСТ Р 52963" },
            { "Содержание общего органического углерода", "ГОСТ Р 52991" },
            { "Содержание растворенного органического углерода", "ГОСТ Р 52991" },
            { "Содержание катионов аммония", "ГОСТ Р 53887" },
            { "Содержание катионов бария", "ГОСТ Р 53887" },
            { "Содержание катионов калия", "ГОСТ Р 53887" },
            { "Содержание катионов лития", "ГОСТ Р 53887" },
            { "Содержание катионов магния", "ГОСТ Р 53887" },
            { "Содержание катионов натрия", "ГОСТ Р 53887" },
            { "Содержание катионов стронция", "ГОСТ Р 53887" },
            { "Содержание полихлорированных бифенилов", "ГОСТ Р 54503" },
            { "Содержание формальдегида", "ГОСТ Р 55227" }
        };

        public Dictionary<string, string> methodsOil = new Dictionary<string, string>()
        {
            { "Массовая доля воды, следы", "ГОСТ 2477" },
            { "Массовая доля воды методом Дина-Старка или термостатированием", "ГОСТ 2477" },
            { "Объемная доля воды", "ГОСТ 2477" },
            { "Плотность при 20 градусах", "ГОСТ 3900" },
            { "Массовая концентрация хлористых солей", "ГОСТ 21534" },
            { "Массовая концентрация взвешенных твердых частиц", "МИ ТатНИПИ нефт 2015" },
            { "Вязкость кинематическая", "ГОСТ 33" },
            { "Массовая доля механических примесей", "ГОСТ 6370" },
            { "Давление насыщенных паров", "ГОСТ 1756" },
            { "Определение коксуемости на аппарате типа ЛКН-70", "ГОСТ 8852" },
            { "Определение температуры текучести", "ГОСТ 20287" },
            { "Определение температуры застывания", "ГОСТ 20287" },
            { "Определение массовой доли серы", "ГОСТ Р 51947" },
            { "Определение содержания механических примесей", "ГОСТ 10577" }
        };
    }
}
